In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_excel('data-combined.xlsx')

In [3]:
df.head()

,Unnamed: 0,Compagnie,Total d'escales,Prix,Duree,Destination,Distance,Date_aller,Date_retour
0,0,Air France,\ndirect,\n204 €,\n2h 20min,Oslo,1344.0,2022-04-01,2022-04-08
1,1,Air France,\ndirect,\n204 €,\n2h 30min,Oslo,1344.0,2022-04-01,2022-04-08
2,2,Flyr AS,\ndirect,\n195 €,\n2h 25min,Oslo,1344.0,2022-04-01,2022-04-08
3,3,Flyr AS,\ndirect,\n195 €,\n2h 25min,Oslo,1344.0,2022-04-01,2022-04-08
4,4,Norwegian,\ndirect,\n186 €,\n2h 20min,Oslo,1344.0,2022-04-01,2022-04-08

In [12]:
df = df.replace('\n','', regex=True)

SyntaxError: (unicode error) 'unicodeescape' codec can't decode bytes in position 0-2: truncated \xXX escape (<ipython-input-12-d30392e83fbd>, line 2)

In [3]:
df.columns

Index(['Unnamed: 0', 'Compagnie', 'Total d'escales', 'Prix', 'Duree',
       'Destination', 'Distance', 'Date_aller', 'Date_retour'],
      dtype='object')

In [8]:
total_stops= list(df["Total d'escales"])
price = list(df['Prix'])
duration = list(df ['Duree'])

In [62]:
def formatage_prix(liste):
    l=[]
    for i in range (len(liste)):
        c=''
        if len(liste[i]) == 6 :
            c = float(liste[i][0]+liste[i][1]+price[i][2])
        elif len(liste[i]) == 5 : 
            c = float(liste[i][0]+liste[i][1])
        elif len(liste[i]) == 8:
            c = float(liste[i][0]+liste[i][2]+liste[i][3]+ liste[i][4])
        else:
            c = 'NaN'
        l.append(c)
    return l

In [65]:
prix = formatage_prix(price)

In [82]:
def formatage_duree(liste):
    l=[]
    for i in range (len(liste)):
        l.append(float(duration[i].split('h')[0])+float(duration[i].split('h')[1][1:3])/60)
    return l

In [83]:
duree = formatage_duree(duration)

In [85]:
del df['Prix']

In [86]:
del df['Duree']

In [87]:
df['Prix'] = prix

In [88]:
df['Duree de vol'] = duree

In [89]:
df

,Unnamed: 0,Compagnie,Total d'escales,Destination,Distance,Date_aller,Date_retour,Prix,Duree de vol
0,0,Air France,direct,Oslo,1344.00,2022-04-01,2022-04-08,204.0,2.333333
1,1,Air France,direct,Oslo,1344.00,2022-04-01,2022-04-08,204.0,2.500000
2,2,Flyr AS,direct,Oslo,1344.00,2022-04-01,2022-04-08,195.0,2.416667
3,3,Flyr AS,direct,Oslo,1344.00,2022-04-01,2022-04-08,195.0,2.416667
4,4,Norwegian,direct,Oslo,1344.00,2022-04-01,2022-04-08,186.0,2.333333
...,...,...,...,...,...,...,...,...,...
61343,61343,Turkish Airlines,1 escale,Athenes,2095.52,2022-06-10,2022-06-17,294.0,7.333333
61344,61344,Sky Express,direct,Athenes,2095.52,2022-06-10,2022-06-17,1874.0,3.000000
61345,61345,SWISS,1 escale,Athenes,2095.52,2022-06-10,2022-06-17,1874.0,5.500000
61346,61346,Sky Express,direct,Athenes,2095.52,2022-06-10,2022-06-17,1879.0,3.000000
61347,61347,Lufthansa,1 escale,Athenes,2095.52,2022-06-10,2022-06-17,1879.0,4.916667